In [98]:
import pandas as pd

In [99]:
data = pd.read_csv('C:\Projects\Titanic_Project\huge_1M_titanic.csv')

##

## Data Preprocessing

In [100]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1310,1,1,"Name1310, Miss. Surname1310",female,NaN,0,0,SOTON/O2 3101272,76.760165,NaN,C
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,NaN,S
2,1312,0,3,"Name1312, Mr. Surname1312",male,20.0,0,0,54636,12.029416,C83,C
3,1313,0,3,"Name1313, Mr. Surname1313",male,27.0,0,0,PC 17760,13.429448,NaN,S
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,E33,C

In [101]:
data.shape

(1000000, 12)

In [102]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 12 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   PassengerId  1000000 non-null  int64
 1   Survived     1000000 non-null  int64
 2   Pclass       1000000 non-null  int64
 3   Name         1000000 non-null  object
 4   Sex          1000000 non-null  object
 5   Age          801400 non-null   float64
 6   SibSp        1000000 non-null  int64
 7   Parch        1000000 non-null  int64
 8   Ticket       1000000 non-null  object
 9   Fare         1000000 non-null  float64
 10  Cabin        229805 non-null   object
 11  Embarked     997760 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 91.6+ MB

In [103]:
data.isnull().sum()

PassengerId         0
Survived            0
Pclass              0
Name                0
Sex                 0
Age            198600
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin          770195
Embarked         2240
dtype: int64

In [104]:
data = data.drop(columns=['PassengerId','Name','Age','Ticket','Cabin'])

In [105]:
data.head()

   Survived  Pclass     Sex  SibSp  Parch       Fare Embarked
0         1       1  female      0      0  76.760165        C
1         0       3    male      0      0  10.193097        S
2         0       3    male      0      0  12.029416        C
3         0       3    male      0      0  13.429448        S
4         0       3    male      0      0   4.840769        C

In [106]:
data.isnull().sum()

Survived       0
Pclass         0
Sex            0
SibSp          0
Parch          0
Fare           0
Embarked    2240
dtype: int64

In [107]:
data['Embarked'].mode()

0    S
Name: Embarked, dtype: object

In [108]:
data['Embarked'].value_counts()

Embarked
S    729468
C    186846
Q     81446
Name: count, dtype: int64

## Data Cleaning

In [109]:
data['Embarked']=data['Embarked'].replace({'S':'Southampton','C':'Chebourg','Q':'Queenstown'})

In [110]:
data.head()

   Survived  Pclass     Sex  SibSp  Parch       Fare     Embarked
0         1       1  female      0      0  76.760165     Chebourg
1         0       3    male      0      0  10.193097  Southampton
2         0       3    male      0      0  12.029416     Chebourg
3         0       3    male      0      0  13.429448  Southampton
4         0       3    male      0      0   4.840769     Chebourg

In [111]:
data['Embarked'].value_counts()

Embarked
Southampton    729468
Chebourg       186846
Queenstown      81446
Name: count, dtype: int64

In [112]:
data.dropna(subset=['Embarked'], inplace=True)

In [113]:
data.isnull().sum()

Survived    0
Pclass      0
Sex         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [114]:
data.shape

(997760, 7)

In [115]:
data['Fare'] = data['Fare'].astype('int8')

In [116]:
data.head()

   Survived  Pclass     Sex  SibSp  Parch  Fare     Embarked
0         1       1  female      0      0    76     Chebourg
1         0       3    male      0      0    10  Southampton
2         0       3    male      0      0    12     Chebourg
3         0       3    male      0      0    13  Southampton
4         0       3    male      0      0     4     Chebourg

## Feature Encoding

In [117]:
## Encoder -- Gender ---> LabelEncoder

In [118]:
from sklearn.preprocessing import LabelEncoder

In [119]:
label = LabelEncoder()

In [120]:
data['Sex']=label.fit_transform(data['Sex'])

In [121]:
data.head()

   Survived  Pclass  Sex  SibSp  Parch  Fare     Embarked
0         1       1    0      0      0    76     Chebourg
1         0       3    1      0      0    10  Southampton
2         0       3    1      0      0    12     Chebourg
3         0       3    1      0      0    13  Southampton
4         0       3    1      0      0     4     Chebourg

In [122]:
from sklearn.preprocessing import OneHotEncoder

In [123]:
onehot = OneHotEncoder(sparse_output=False)

In [124]:
data.columns

Index(['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Fare', 'Embarked'], dtype='object')

In [125]:
Embarked = onehot.fit_transform(data[['Embarked']])

In [126]:
Embarked = pd.DataFrame(Embarked, columns=onehot.get_feature_names_out())

In [127]:
Embarked

        Embarked_Chebourg  Embarked_Queenstown  Embarked_Southampton
0                     1.0                  0.0                   0.0
1                     0.0                  0.0                   1.0
2                     1.0                  0.0                   0.0
3                     0.0                  0.0                   1.0
4                     1.0                  0.0                   0.0
...                   ...                  ...                   ...
997755                0.0                  0.0                   1.0
997756                0.0                  0.0                   1.0
997757                0.0                  0.0                   1.0
997758                0.0                  0.0                   1.0
997759                0.0                  0.0                   1.0

[997760 rows x 3 columns]

In [128]:
data = pd.concat([data.drop(columns=['Embarked']), Embarked],axis=True)

In [129]:
data.head()

,Survived,Pclass,Sex,SibSp,Parch,Fare,Embarked_Chebourg,Embarked_Queenstown,Embarked_Southampton
0,1.0,1.0,0.0,0.0,0.0,76.0,1.0,0.0,0.0
1,0.0,3.0,1.0,0.0,0.0,10.0,0.0,0.0,1.0
2,0.0,3.0,1.0,0.0,0.0,12.0,1.0,0.0,0.0
3,0.0,3.0,1.0,0.0,0.0,13.0,0.0,0.0,1.0
4,0.0,3.0,1.0,0.0,0.0,4.0,1.0,0.0,0.0

## Feature Scaling

In [130]:
from sklearn.preprocessing import StandardScaler

In [131]:
scale = StandardScaler()

In [132]:
data.columns

Index(['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Fare',
       'Embarked_Chebourg', 'Embarked_Queenstown', 'Embarked_Southampton'],
      dtype='object')

In [133]:
num_cols = ['Pclass', 'SibSp', 'Parch', 'Fare']

In [134]:
data[num_cols]=scale.fit_transform(data[num_cols])

In [135]:
data.head()

,Survived,Pclass,Sex,SibSp,Parch,Fare,Embarked_Chebourg,Embarked_Queenstown,Embarked_Southampton
0,1.0,-1.568865,0.0,-0.462644,-0.469267,1.675922,1.0,0.0,0.0
1,0.0,0.824107,1.0,-0.462644,-0.469267,-0.234102,0.0,0.0,1.0
2,0.0,0.824107,1.0,-0.462644,-0.469267,-0.176222,1.0,0.0,0.0
3,0.0,0.824107,1.0,-0.462644,-0.469267,-0.147283,0.0,0.0,1.0
4,0.0,0.824107,1.0,-0.462644,-0.469267,-0.407741,1.0,0.0,0.0

In [136]:
import pickle

In [137]:
with open('label_encoder.pkl', 'wb')as file:
    pickle.dump(label,file)

In [138]:
with open('onehot_encoder.pkl', 'wb')as file:
    pickle.dump(onehot,file)

In [139]:
with open('scaler.pkl', 'wb')as file:
    pickle.dump(scale,file)

## Train-Validation-Test split

In [140]:
data.head()

,Survived,Pclass,Sex,SibSp,Parch,Fare,Embarked_Chebourg,Embarked_Queenstown,Embarked_Southampton
0,1.0,-1.568865,0.0,-0.462644,-0.469267,1.675922,1.0,0.0,0.0
1,0.0,0.824107,1.0,-0.462644,-0.469267,-0.234102,0.0,0.0,1.0
2,0.0,0.824107,1.0,-0.462644,-0.469267,-0.176222,1.0,0.0,0.0
3,0.0,0.824107,1.0,-0.462644,-0.469267,-0.147283,0.0,0.0,1.0
4,0.0,0.824107,1.0,-0.462644,-0.469267,-0.407741,1.0,0.0,0.0

In [141]:
X=data.drop(columns='Survived')

In [142]:
y=data['Survived']

In [143]:
X.head()

,Pclass,Sex,SibSp,Parch,Fare,Embarked_Chebourg,Embarked_Queenstown,Embarked_Southampton
0,-1.568865,0.0,-0.462644,-0.469267,1.675922,1.0,0.0,0.0
1,0.824107,1.0,-0.462644,-0.469267,-0.234102,0.0,0.0,1.0
2,0.824107,1.0,-0.462644,-0.469267,-0.176222,1.0,0.0,0.0
3,0.824107,1.0,-0.462644,-0.469267,-0.147283,0.0,0.0,1.0
4,0.824107,1.0,-0.462644,-0.469267,-0.407741,1.0,0.0,0.0

In [144]:
y.head()

0    1.0
1    0.0
2    0.0
3    0.0
4    0.0
Name: Survived, dtype: float64

In [145]:
from sklearn.model_selection import train_test_split

In [146]:
X_train, X_test, y_train, y_test=train_test_split(X,y,test_size=20, random_state = 42)

In [147]:
X_train, X_valid, y_train, y_valid=train_test_split(X_train, y_train, test_size=0.2, random_state=42)

In [148]:
X_train.shape

(799979, 8)

In [149]:
X_valid.shape

(199995, 8)